package Task7;

public class Tests {
        //1 - 5-е число - начало подпоследовательности, длина 15.
        public static int[] test1 ={303, 77, 295, 203, 466, 77, 248, 485, 227, 369, 323, 285, 123, 270, 450, 133, 43, 9, 462, 209};
        //2 - 17-е число - начало подпоследоватнльности, длина 3.
        public static int[] test2 = {76, 100, 43, 2, 8, 23, 87, 25, 61, 47, 29, 77, 13, 78, 11, 39, 28, 28, 69, 38};
        //3 - 10-е число - начало подпоследовательности, длина 10.
        public static int[] test3 = {9, 6, 10, 8, 4, 1, 2, 5, 7, 3, 10, 3, 4, 5, 6, 8, 7, 2, 1, 9};
        //4 - 0-е число - начало подпоследовательности, длина 10.
        public static int[] test4 = {20, 6, 8, 3, 7, 12, 16, 11, 9, 4};
        //5 - 9-е число - начало подпоследовательности, длина 1.
        public static int[] test5 = {77, 77, 77, 77, 77, 77, 77, 77, 77, 77};
        //6 - 8-е число - начало подпоследовательности, длина 4.
        public static int[] test6 = {1, 2, 4, 3, 3, 4, 2, 1, 1, 2, 3, 4};
        //7 - 10-е число - начало подпоследовательности, длина 3.
        public static int[] test7 = {1, 2, 4, 3, 3, 4, 2, 1, 1, 2, 3, 4, 2};
        //8 - 11-е число - начало подпоследовательности, длина 4.
        public static int[] test8 = {172, 195, 106, 67, 112, 172, 3, 18, 176, 104, 172, 33, 111, 161, 172};
        //9 - 1-е число - начало подпоследовательности, длина 14.
        public static int[] test9 = {172, 195, 106, 67, 112, 174, 3, 18, 176, 104, 173, 33, 111, 161, 172};
        //10 - 16-е число - начало подпоследовательности, длина 14.
        public static int[] test10 = {68, 51, 65, 30, 37, 15, 77, 7, 57, 68, 20, 11, 27, 12, 5, 33, 68, 17, 18, 8, 54, 73, 26, 16, 41, 75, 59, 64, 28, 21};
}
